---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarShapeParameters
source: html/410cd7f1-d789-0ee5-6570-3890b8223c81.htm
---
# RebarShapeParameters Properties

Specifies whether the .NET object represents a valid Revit entity.